app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('こんにちは', 2, 1, '2021-05-03 02:12:03.059855', '2021-05-03 02:12:03.059855')
---
  def create
    if comment = Comment.create(comment_params)