app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.all
---
SELECT `prototypes`.* FROM `prototypes`

  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('あああ', 'あああ', 'あああ', 5, '2021-05-03 10:47:54.972064', '2021-05-03 10:47:54.972064')

  def show
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 4

  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 8 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`catch_copy` = 'すごい', `prototypes`.`updated_at` = '2021-05-03 10:43:09.103626' WHERE `prototypes`.`id` = 8

  def destroy
    prototype = Prototype.find(params[:id])
    if prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 6 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 7

  def set_prototype
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 8 LIMIT 1